import image1 from "@/assets/images/dummy.jpg";
import { AboutUsInfoProps } from "@/types/about-us";

export const aboutUsInfo: AboutUsInfoProps = {
  section1: {
    data: {
      title: "درباره ی ما",
      subtitle: "ما Eram Home هستیم",
      url: "",
      image_info: {
        url: image1,
      },
    },
  },
  section2: {
    description: `ما مبلمان منحصر به فردی خلق می‌کنیم که روش‌های جدید زندگی، کار و تفریح مردم را بهبود می‌بخشد.
بیش از ۷۰ سال است که ما با بهترین طراحان جهان همکاری کرده‌ایم تا مبلمانی خلق کنیم که به خاطر مدولار بودن، کارایی و کیفیت بی‌نظیرشان مشهور هستند. از طریق خلاقیت و هنر، ما فضاها را با طراحی نمادین و جاودانه ارتقا می‌دهیم که شادی و الهام را به ارمغان می‌آورد.
ما تلاش می‌کنیم تا با طراحی خاص و منحصربه فرد، زندگی را برای همه ارتقا دهیم و این ماموریت، الهام‌بخش شعار ماست: زندگی با شکوه.`,
  },
  section3: {
    title: "طراحی منحصر به فرد با Eram Home",
    description: `محصولات Eram Home منعکس کننده ارزش‌های هنر دست، سادگی، کارایی و مواد باکیفیت هستند که ریشه‌های طراحی منحصر به فرد ما را تعریف می‌کنند.`,
  },
  section4: [
    {
      id: 1,
      imageSrc: image1,
      title: "عملکرد",
      description: `طرح‌های ما هدفمند هستند و سنت طراحی مدرن را که به عملکرد و فرم بها می‌دهد، ادامه می‌دهند.`,
    },
    {
      id: 2,
      imageSrc: image1,
      title: "احساس",
      description: `محصولات ما به طور شهودی جذاب و دلپذیر هستند و برای حواس جذاب می‌باشند.`,
    },
    {
      id: 3,
      imageSrc: image1,
      title: "فرم",
      description: `ما با دقت هر جزئیات را در نظر می‌گیریم و به طرح‌های خود حسی از دقت خالص و مهارت هدفمند می‌دهیم.`,
    },
  ],
  section5: {
    data: {
      title: "تاریخچه ما",
      subtitle: "طراحی جاودانه از سال 1394",
      url: "",
      description:
        "شرکت EramHome از سال 1394 در خراسان رضوی مشغول طراحی، توسعه و تولید مبلمان است.",
      image_info: {
        url: image1,
      },
    },
  },
};
